const pagl = +localStorage.getItem('page_iillkuuuu') || 0;

function set(n=0) {
  localStorage.setItem('page_iillkuuuu', n);
}

document.addEventListener('keydown', (e) => {
  if (e.key === 'ArrowLeft') {
    before();
  } else if (e.key === 'ArrowRight') {
    next();
  }
})

document.getElementById("car").onclick = () => {
  window.location.href = "/m/";
}

document.getElementById("pre").onclick = () => {
  window.location.href = "/m/contemp";
}

const pr = [
  `<h2>Тема:<h2><h3> Однообразие шума Читы в современном мире<h3>
  <h2>ФИО:<h2><h3> Лончаков Сергей Константинович<h3>
  <h2>Класс:<h2><h3> 8A<h3>
  <h2>ФИО руководителя:<h2><h3> Голикова Оксана Валерьевна<h3>`,

  `<h2>Паспорт звуков:<h2><h3>Все звуки записаны на улице или в помещении (in - внутри, без in - улица) мной лично в дату, указанную в названии:
  <br>2026 09 14 - 07 29 арена.mp3 - возле тц.Арена<br>
  2026 09 14 - 07 35 школа 27 in.mp3 - в 27 школе<br>
  2026 09 14 - 11 17 школа 27 in.mp3 - в 27 школе<br>
  2026 09 14 - 14 24 царский.mp3 - возле тц. Царский<br>
  2026 09 16 - 20 40 царский in.mp3 - в тц. Царский<br>
  2026 09 14 - 19 38 абсолют.mp3 - возле тц. Абсолют<br>
  2026 09 16 - 13 11 школа 22.mp3 - возле школы 22<br>
  2026 09 16 - 13 30 макси in.mp3 - в тц. Макси<br>
  2026 09 16 - 13 31 макси.mp3 - возле тц. Макси<br>
  2026 09 16 - 19 35 площадь Ленина.mp3 - на площади Ленина<br>
  2026 09 16 - 19 39 вход в парк культуры и отдыха.mp3 - на входе в парк<br>
  2026 09 16 - 19 49 вокзал.mp3 - возле вокзала Чита-2<br>
  2026 09 16 - 20 51 троллейбусное депо.mp3 - возле троллейбусного депо<h3>`,

  `<h2>Источники: Собственные аудиозаписи<h2>
  <h2>Направление: Улица сегодня: звуки нашего края<h2>
  <h2>Тема: Однообразие шума Читы в современном мире<h2>
  <h2>Цель: узнать как звучит город в разных его точках<h2>
  <h2>Продукт: интерактивная карта<h2>
  <h2>Гипотеза: шум будет похож между собой, но будут слышны слабые различия<h2>
  <h2><h2><h3><h3>`,

  `<h2>Ресурсы: диктофон на телефоне, статический хостинг<h2>
  <h2>Проблема: в открытом доступе нет интерактивной карты звуков г. Читы, которые могут быть кому-то полезны<h2>
  <h2>Маршрут: ходил по основным объектам/зданиям города Чита<h2>
  <h2>Выводы: Эта работа дала мне карту звуков города. Гипотеза подтвердилась, шумы похожи, но имеют свои особенности<h2>
  <h2>Судьба звуков: сайт продолжит существовать, позволяя пользоваться этой картой.<h2>`,

  `<h2>Рефлексия:<h2>
  <h3>Работая над этим проектом я научился:<h4>Использовать не идеальные материалы для проекта.<br>
  Не использовать информацию из Интернета, используя только свои силы.<h4><h3>
  <h3>Самое сложное было:<h4>Выбрать конкретные точки, для записи звуков<br>
  Проходить до точки записи звука<h4><h3>
  <h3>Как можно использовать:<h4>Для демонстрации проекта, как пример для других учеников<br>
  Прослушать звуки точек в конкретное время суток
<h4><h3>
  `,

  `<h1>Спасибо за внимание!<h1>`
]
let page = pagl;

document.querySelector(".imeg").innerHTML = '<div style="height: 1000px; display:flex; flex-direction:column; align-items:center; justify-content:center;">' + pr[page] + '<div>';

function next() {
  if(page < pr.length-1) {
    page++;
    set(page);
  } else {
    page = pr.length-1;
  }
  document.querySelector(".imeg").innerHTML = '<div style="height: 1000px; display:flex; flex-direction:column; align-items:center; justify-content:center;">' + pr[page] + '<div>';
}

function before() {
  if(page > 0) {
    page--;
    set(page);
  } else {
    page = 0;
  }
  document.querySelector(".imeg").innerHTML = '<div style="height: 1000px; display:flex; flex-direction:column; align-items:center; justify-content:center;">' + pr[page] + '<div>';
}